snlkuharlocal/src/Documents/ПредварительныйЗаказКлиента/ПредварительныйЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПредварительныйЗаказКлиента</name>
  <comment>https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2474</comment>
  <registerRecords>AccumulationRegister.ОстаткиТМЦ</registerRecords>
  <registerRecords>AccumulationRegister.РезервыТМЦ</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаКомплектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКомплектующих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаказКлиентаFBS</types>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>СекторХранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяМаркировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодтвержденнаяЗаявка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПосредника</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезБонуса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоБезБонуса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяМаркировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>56</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>56</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрефиксЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>56</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуффиксЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>56</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РИД</name>
      <comment>идентификатор вайлдб. для обмена.</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>56</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗаказа</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеУКлиента</name>
      <type>
        <types>CatalogRef.СостояниеНакладнойУКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>АртикулКонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтменаОтработана</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрэкНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛогистСервис</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВычеркОфис</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВычеркСклад</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПереданоНаСайт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКомплектующих</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПоЮрЛицу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПродукции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяМаркировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>56</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РИД</name>
      <comment>идентификатор вайлдб. для обмена.</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>56</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/Отгружен/Отгружен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Отгружен</name>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>Резерв</name>
  </enumValues>
  <enumValues>
    <name>РезервТранзит</name>
    <comment>Резерв транзит</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженТранзит</name>
    <comment>Отгружен на транзит</comment>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ПредварительныйЗаказКлиента/Forms/ФормаДокументаУпр/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	КэшОстатков = Новый Соответствие;
	
	СписокНоменклатуры = Объект.Товары.Выгрузить().ВыгрузитьКолонку("Номенклатура");
	
	Для каждого Комплектующее из Объект.Комплектующие.Выгрузить().ВыгрузитьКолонку("Номенклатура") Цикл
		СписокНоменклатуры.Добавить(Комплектующее);
	КонецЦикла;
	
	ПолучитьОстаткиСервер(СписокНоменклатуры, Объект.Склад, Объект.Ссылка, КэшОстатков);
	
	Для каждого СтрокаТабличнойЧастиТовары из Объект.Товары Цикл
		ДанныеОстатка = КэшОстатков[СтрокаТабличнойЧастиТовары.Номенклатура];
		Если ДанныеОстатка = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТабличнойЧастиТовары.Остаток = ДанныеОстатка.СвободныйОстаток;
	КонецЦикла;
	
	Для каждого СтрокаТабличнойЧастиКомплектующие из Объект.Комплектующие Цикл
		ДанныеОстатка = КэшОстатков[СтрокаТабличнойЧастиКомплектующие.Номенклатура];
		Если ДанныеОстатка = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТабличнойЧастиКомплектующие.Остаток = ДанныеОстатка.СвободныйОстаток;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказатьОстаткиПриИзменении(Элемент)
	
	Элементы.ТоварыОстаток.Видимость = ПоказатьОстатки;
	Элементы.КомплектующиеОстаток.Видимость = ПоказатьОстатки;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьПеремещениеТовары(Команда)
	
	ОткрытьФорму("Документ.Перемещение.Форма.ФормаДокумента",
		Новый Структура("Ключ", СформироватьПеремещениеНаСервере(СтрРазделить(Команда.Имя, "_")[0])));
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПеремещениеКомлектующие(Команда)
	
	ОткрытьФорму("Документ.Перемещение.Форма.ФормаДокумента",
		Новый Структура("Ключ", СформироватьПеремещениеНаСервере(СтрРазделить(Команда.Имя, "_")[0])));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Сформировать перемещение на сервере.
// 
// Параметры:
//  ИмяТаблицы - Строка - Имя таблицы
// 
// Возвращаемое значение:
//  ДокументСсылка.Перемещение - Сформировать перемещение на сервере
&НаСервере
Функция СформироватьПеремещениеНаСервере(ИмяТаблицы)
	
	// Легаси
	КэшОстатков = Новый Соответствие;
	
	СписокНоменклатуры = Объект[ИмяТаблицы].Выгрузить().ВыгрузитьКолонку("Номенклатура");
	
	ПолучитьОстаткиСервер(СписокНоменклатуры,Объект.Склад,Объект.Ссылка,КэшОстатков);
	
	Подсортировка = документы.Перемещение.СоздатьДокумент();
	Подсортировка.СкладПолучатель = Объект.Склад;
	
	РеквизитыСклада = ЗначенияРеквизитовОбъекта(Объект.Склад, "ФизическийСклад, Организация");
	РеквизитыПользователя = ЗначенияРеквизитовОбъекта(ПараметрыСеанса.Пользователь, "ФизЛицо");
	
	Если РеквизитыСклада.ФизическийСклад <> Объект.Склад И ЗначениеЗаполнено(РеквизитыСклада.ФизическийСклад) Тогда
		Подсортировка.Склад = РеквизитыСклада.ФизическийСклад;
	иначе
		Справочники.Склады.НайтиПоКоду("STA-48");
	КонецЕсли;
	
	Подсортировка.ИБ = Справочники.ИБ.НайтиПоКоду(ПолучитьПрефиксИБСервер(Объект.Склад));
	Подсортировка.Менеджер = РеквизитыПользователя.ФизЛицо;
	Подсортировка.Автор = ПараметрыСеанса.Пользователь;
	Подсортировка.Организация = РеквизитыСклада.Организация;
	Подсортировка.ПунктДоставки = Справочники.ПунктыДоставки.НайтиПоКоду("OD7-000002");
	
	Подсортировка.Комментарий = Объект.Номер;
	
	Подсортировка.СостояниеНакладной = Перечисления.СостоянияНакладной.ВРаботе;
	Подсортировка.СостояниеНакладнойУПолучателя = Перечисления.СостоянияНакладной.ВРаботе;
	Подсортировка.Отгружен = Перечисления.Отгружен.Резерв;
	Подсортировка.Дата = ТекущаяДатаСеанса();
	Подсортировка.Валюта = Справочники.Валюты.НайтиПоКоду("810");
	Подсортировка.Курс = 1;
	
	УстановитьНомерДокументаКлиентСервер(Подсортировка);
	
	Для Каждого СтрокаТЗДляПРМ Из Объект[ИмяТаблицы] Цикл
		СтрокаКэша=КэшОстатков.Получить(СтрокаТЗДляПРМ.Номенклатура);		
		СвободныйОстаток=?(СтрокаКэша<>Неопределено,СтрокаКэша.СвободныйОстаток,0);
		НеХватает = СтрокаТЗДляПРМ.Количество - СвободныйОстаток;
		Если НеХватает > 0 Тогда
			СтрТЧ = Подсортировка.Товары.Добавить();
			СтрТЧ.Номенклатура = СтрокаТЗДляПРМ.номенклатура;
			СтрТЧ.Заявка = НеХватает;
			стртч.ПодтвержденнаяЗаявка = НеХватает;
			стртч.ПодтвержденнаяЗаявкаПеремещения = НеХватает;
			СтрТЧ.Количество = НеХватает;
			
			ПриИзмененииНоменклатурыТабЧасти(СтрТЧ, Подсортировка);
			
			РассчитатьСуммуТабЧасти(СтрТЧ, Подсортировка);
		КонецЕсли;
	КонецЦикла;
	
	Если Подсортировка.Товары.Количество() > 0 тогда
		Подсортировка.Записать(РежимЗаписиДокумента.Запись);
		
		Возврат Подсортировка.Ссылка;
	КонецЕсли;
	
КонецФункции // СформироватьПеремещениеНаСервере()

#КонецОбласти
